Revit 2024 API
Pipe.PipeSegment Property
 The pipe segment that was assigned to this pipe according to the routing preference.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public PipeSegment PipeSegment { get; }
Visual Basic
Public ReadOnly Property PipeSegment As PipeSegment
	Get
Visual C++
public:
property PipeSegment^ PipeSegment {
	PipeSegment^ get ();
}
See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace